lab6/app/Controllers/Auth.php

            $password = $this->request->getPost('password');

            // Check database for user
            $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'teacher@lms.com'
 LIMIT 1